TexasInstruments/f29h85x-mcal/plugins/Can_TI_F29H85x/generate/include/Can_Cfg.h
/*
 *Design: MCAL-22748,MCAL-22745
 */
[!IF "node:exists(CanGeneral/CanLPduReceiveCalloutFunction) = 'true'"!]
[!IF "CanGeneral/CanLPduReceiveCalloutFunction/* = ''"!]
[!ERROR "CanLPduReceiveCalloutFunction should not be NULL"!][!//
[!ENDIF!]

#define CAN_LPDU_RECEIVE_CALLOUT_FUNCTION            [!"CanGeneral/CanLPduReceiveCalloutFunction"!]
extern boolean [!"CanGeneral/CanLPduReceiveCalloutFunction"!](Can_HwHandleType Hrh, Can_IdType CanId, uint8 CanDataLegth,const uint8* CanSduPtr);
[!ENDIF!]


/*****************************************************************************
 *
 * \brief Enable/Disable CanMultiplexedTransmission.
 *
 *****************************************************************************/
/*
 *Design: MCAL-22752,MCAL-22745
 */
#define CAN_CFG_MULTIPLEXED_TX     [!IF "CanGeneral/CanMultiplexedTransmission = 'true'"!](STD_ON)[!ELSE!](STD_OFF)[!ENDIF!]


/*****************************************************************************
 *
 * \brief Enable/Disable Can_GetVersionInfo().
 *
 *****************************************************************************/
/*
 *Design: MCAL-22756
 */
#define CAN_CFG_GET_VERSION_INFO_API         [!IF "CanGeneral/CanVersionInfoApi = 'true'"!](STD_ON)[!ELSE!](STD_OFF)[!ENDIF!]

/*****************************************************************************
 *
 * \brief Enable/Disable Can_SetBuadrate().
 *
 *****************************************************************************/
/*
 *Design: MCAL-22754
 */
#define CAN_CFG_SET_BAUDRATE_API         [!IF "CanGeneral/CanSetBaudrateApi = 'true'"!](STD_ON)[!ELSE!](STD_OFF)[!ENDIF!]


/*****************************************************************************
 *
 * \brief Enable/Disable ECC configuration.
 *
 *****************************************************************************/
#define CAN_CFG_ECC         [!IF "CanGeneral/CanECCSupport = 'true'"!](STD_ON)[!ELSE!](STD_OFF)[!ENDIF!]


/*****************************************************************************
 *
 * \brief Different periods for the main function read and write.
 *
 *****************************************************************************/
/*
 *Design: MCAL-22802
 */
/*<CAN_CFG_MAINFUNCTIONREADWRITE_LIST>*/
[!LOOP "CanGeneral"!][!LOOP "CanMainFunctionRWPeriods/*"!][!//
/* Symbolic name of the RW period [!"@index"!]*/
#define [!"@name"!]    [!"@index"!] /*~ASR~*/

/* main function write for the period */
#define Can_MainFunction_Write_[!"@name"!]() Can_MainFunction_Write([!"@name"!])  /*~ASR~*/

/* main function read for the period */
#define Can_MainFunction_Read_[!"@name"!]() Can_MainFunction_Read([!"@name"!])  /*~ASR~*/

[!ENDLOOP!][!ENDLOOP!][!//
/*<CAN_CFG_MAINFUNCTIONREADWRITE_LIST>*/

/*****************************************************************************
 *
 * \brief CAN timeout - used in CAN Cancel wait and Start/Stop busy wait.
 *  Specifies the maximum time for blocking function until a timeout is detected.
 *  Unit is milli seconds.
 *
 *****************************************************************************/
/*
 *Design: MCAL-22755
 */

[!VAR "sysClockFrequency"="num:i(node:value(concat(node:path(node:ref(CanGeneral/CanSysClockRef)), '/McuClockReferencePointFrequency')))"!]
#define CAN_CFG_TIMEOUT_DURATION    ((McalLib_TickType)([!"num:i(CanGeneral/CanTimeoutDuration * $sysClockFrequency)"!]U))

/*****************************************************************************
 *
 * \brief CAN timeout in cycles - used in CAN memory initialization wait.
 *  Specifies the maximum time for blocking function until a timeout is detected.
 *  Unit is cycles.
 *
 *****************************************************************************/
#define CAN_CFG_TIMEOUT_DURATION_CYCLES	    ((uint32)[!"num:i(num:mul(CanGeneral/CanTimeoutDuration,10000000))"!]U)
[!//
[!VAR "wakeupfunc"="0"!][!//
[!VAR "txpoll"="0"!][!//
[!VAR "rxpoll"="0"!][!//
[!VAR "busoffpoll"="0"!][!//
[!VAR "wakeuppoll"="0"!][!//
[!LOOP "CanConfigSet/CanController/*"!][!//
[!IF "CanWakeupFunctionalityAPI = 'true'"!][!//
    [!VAR "wakeupfunc" = "$wakeupfunc + 1"!][!//
[!ENDIF!][!//
[!IF "CanTxProcessing != 'INTERRUPT'"!][!//
    [!VAR "txpoll" = "$txpoll + 1"!][!//
[!ENDIF!][!//
[!IF "CanRxProcessing != 'INTERRUPT'"!][!//
    [!VAR "rxpoll" = "$rxpoll + 1"!][!//
[!ENDIF!][!//
[!IF "CanBusoffProcessing = 'POLLING'"!][!//
    [!VAR "busoffpoll" = "$busoffpoll + 1"!][!//
[!ENDIF!][!//
[!IF "CanWakeupProcessing = 'POLLING'"!][!//
    [!VAR "wakeuppoll" = "$wakeuppoll + 1"!][!//
[!ENDIF!][!//
[!ENDLOOP!][!//


/*****************************************************************************
 *
 * \brief Enable/Disable Can_CheckWakeup() 
 *
 *****************************************************************************/
#define CAN_CFG_WAKEUP_FUNCTIONALITY_API     [!IF "$wakeupfunc = 0"!](STD_OFF)[!ELSE!](STD_ON)[!ENDIF!]

/*****************************************************************************
 *
 * \brief For all controllers setting needs to be same either polling or interrupt 
 *   No mixed mode is allowed. Enable/Disable Can_MainFunction_Write. 
 *
 *****************************************************************************/
#define CAN_TX_POLLING                       [!IF "$txpoll = 0"!](STD_OFF)[!ELSE!](STD_ON)[!ENDIF!]

/*****************************************************************************
 *
 * \brief For all controllers setting needs to be same either polling or interrupt
 *  No mixed mode is allowed. Enable/Disable Can_MainFunction_Read. 
 *
 *****************************************************************************/
#define CAN_RX_POLLING                       [!IF "$rxpoll = 0"!](STD_OFF)[!ELSE!](STD_ON)[!ENDIF!]

/*****************************************************************************
 *
 * \brief For all controllers setting needs to be same either polling or interrupt
 *  No mixed mode is allowed. Enable/Disable Can_MainFunction_BusOff. 
 *
 *****************************************************************************/
#define CAN_BUSOFF_POLLING                   [!IF "$busoffpoll = 0"!](STD_OFF)[!ELSE!](STD_ON)[!ENDIF!]

/*****************************************************************************
 *
 * \brief For all controllers setting needs to be same either polling or interrupt
 *  No mixed mode is allowed. Enable/Disable Can_MainFunction_Wakeup.
 *
 *****************************************************************************/
#define CAN_WAKEUP_POLLING                   [!IF "$wakeuppoll = 0"!](STD_OFF)[!ELSE!](STD_ON)[!ENDIF!]


/*****************************************************************************
 *
 * \brief Enable/Disable Can Trigger Transmit.
 *
 *****************************************************************************/
#define CAN_TRIGGER_TRANSMIT_ENABLE          [!IF "count(CanConfigSet/CanHardwareObject/*[CanTriggerTransmitEnable = 'true']) > 0"!](STD_ON)[!ELSE!](STD_OFF)[!ENDIF!]

/*****************************************************************************
 *
 * \brief Defines for symbolic names for the CanHardwareObjectIds 
 *
 *****************************************************************************/
[!LOOP "CanConfigSet/CanHardwareObject/*"!][!//
#define CanConf_CanHardwareObject_[!"@name"!] ([!"CanObjectId"!]U)  /*~ASR~*/
[!ENDLOOP!][!//

/*****************************************************************************
 *
 * \brief Defines for symbolic names for the Can controller ID's (CanControllerId) 
 *
 *****************************************************************************/
[!LOOP "CanConfigSet/CanController/*"!][!//
#define CanConf_CanController_[!"@name"!] ([!"CanControllerId"!]U)  /*~ASR~*/
[!ENDLOOP!][!//

