TexasInstruments/f29h85x-mcal/plugins/Can_TI_F29H85x/generate/include/Can_Cfg.h
/*
 *Design: MCAL-24206
 */
/*****************************************************************************
 *
 * \brief Can Controller Instance interrupt definition 
 *
 *****************************************************************************/
[!IF "node:refexists(CanGeneral/CanDemEventParameterRefs/CAN_E_HARDWARE_ERROR) or node:refexists(CanGeneral/CanDemEventParameterRefs/CAN_E_SAFTEY_BEU_ERROR )"!]
[!LOOP "CanConfigSet/CanController/*"!][!//
#define CAN_[!"(node:ref(CanControllerInstance)/InstanceName)"!]_ENABLE
[!IF "CanInteruptType = 'CAN_ISR_CAT1_RTINT'"!][!//
#define CAN_[!"(node:ref(CanControllerInstance)/InstanceName)"!]_ISR_CAT1_RTINT
[!ELSEIF "CanInteruptType = 'CAN_ISR_CAT1_INT'"!][!//
#define CAN_[!"(node:ref(CanControllerInstance)/InstanceName)"!]_ISR_CAT1_INT
[!ELSE!][!//
#define CAN_[!"(node:ref(CanControllerInstance)/InstanceName)"!]_ISR_CAT2
[!ENDIF!][!//
[!ENDLOOP!][!//
[!ELSE!][!//
[!LOOP "CanConfigSet/CanController/*"!][!//
[!IF "CanRxProcessing !='POLLING' or CanTxProcessing !='POLLING' or CanBusoffProcessing ='INTERRUPT' or CanWakeupProcessing ='INTERRUPT'"!]
#define CAN_[!"(node:ref(CanControllerInstance)/InstanceName)"!]_ENABLE
[!IF "CanInteruptType = 'CAN_ISR_CAT1_RTINT'"!][!//
#define CAN_[!"(node:ref(CanControllerInstance)/InstanceName)"!]_ISR_CAT1_RTINT
[!ELSEIF "CanInteruptType = 'CAN_ISR_CAT1_INT'"!][!//
#define CAN_[!"(node:ref(CanControllerInstance)/InstanceName)"!]_ISR_CAT1_INT
[!ELSE!][!//
#define CAN_[!"(node:ref(CanControllerInstance)/InstanceName)"!]_ISR_CAT2
[!ENDIF!][!//
[!ENDIF!][!//
[!ENDLOOP!][!//
[!ENDIF!][!//


/*****************************************************************************
 *
 * \brief Max number of controllers defined
 *
 *****************************************************************************/
/*
 *Design: MCAL-23019
 */
#define KMAX_CONTROLLER                      ([!"num:i(count(CanConfigSet/CanController/*))"!]U)

/*****************************************************************************
 *
 * \brief Max number of mailboxes defined 
 *
 *****************************************************************************/
#define KMAX_MAILBOXES                       ([!"num:i(count(CanConfigSet/CanHardwareObject/*))"!]U)

/*****************************************************************************
 *
 * \brief Max number of Icom configurations defined 
 *
 *****************************************************************************/
#define MAX_ICOM_CONFIGURATION               ([!"num:i(count(CanConfigSet/CanIcom/CanIcomConfig/*))"!]U)

[!VAR "IcomMax" =  "0"!][!//
[!VAR "IcomRxsignals" =  "0"!][!//
[!LOOP "CanConfigSet/CanIcom/CanIcomConfig/*"!][!//
[!VAR "IcomRxcount" = "num:i(count(CanIcomWakeupCauses/CanIcomRxMessage/*))"!][!//
[!IF "num:i($IcomRxcount) > num:i($IcomMax)"!][!//
[!VAR "IcomMax" = "$IcomRxcount"!][!//
[!ENDIF!][!//
[!LOOP "CanIcomWakeupCauses/CanIcomRxMessage/*"!][!//
[!VAR "IcomRxsignalscount" = "num:i(count(CanIcomRxMessageSignalConfig/*))"!][!//
[!IF "num:i($IcomRxsignalscount) > num:i($IcomRxsignals)"!][!//
[!VAR "IcomRxsignals" = "$IcomRxsignalscount"!][!//
[!ENDIF!][!//
[!ENDLOOP!][!//	
[!ENDLOOP!][!//	

/*****************************************************************************
 *
 * \brief Max number of Icom messages defined 
 *
 *****************************************************************************/
#define MAX_ICOM_MESSAGES ([!"num:i($IcomMax)"!]U)
/*****************************************************************************
 *
 * \brief Max number of Icom RX message signals defined 
 *
 *****************************************************************************/
#define MAX_ICOM_RX_SIGNAL_COUNT ([!"num:i($IcomRxsignals)"!]U)




/* DEM Error Definitions */
/* DEM Error Codes */
/*********************************************************************************************************************
 * \brief Enable/Disable DEM for Hardware failure.
 *********************************************************************************************************************/
#define CAN_CFG_DEM_ENABLE    [!IF "node:refexists(CanGeneral/CanDemEventParameterRefs/CAN_E_HARDWARE_ERROR)"!](STD_ON)[!ELSE!](STD_OFF)[!ENDIF!]

[!IF "node:refexists(CanGeneral/CanDemEventParameterRefs/CAN_E_HARDWARE_ERROR)"!]

#define CAN_E_HARDWARE_ERROR  (DemConf_DemEventParameter_[!"node:name(node:ref(CanGeneral/CanDemEventParameterRefs/CAN_E_HARDWARE_ERROR))"!])
[!ENDIF!]

/*********************************************************************************************************************
 * \brief Enable/Disable DEM for ECC BEU error.
 *********************************************************************************************************************/
#define CAN_CFG_DEM_BEU_ENABLE    [!IF "node:refexists(CanGeneral/CanDemEventParameterRefs/CAN_E_SAFTEY_BEU_ERROR)"!](STD_ON)[!ELSE!](STD_OFF)[!ENDIF!]

[!IF "node:refexists(CanGeneral/CanDemEventParameterRefs/CAN_E_SAFTEY_BEU_ERROR)"!]

#define CAN_E_SAFTEY_BEU_ERROR  (DemConf_DemEventParameter_[!"node:name(node:ref(CanGeneral/CanDemEventParameterRefs/CAN_E_SAFTEY_BEU_ERROR))"!])
[!ENDIF!]

/*****************************************************************************
 *
 * \brief Max number of receive dedicated mailboxes per controller 
 *
 *****************************************************************************/
#define KMAX_RX_MB_PER_CONTROLLER               (64U)

/*****************************************************************************
 *
 * \brief Max number of transmit dedicated mailboxes per controller 
 *
 *****************************************************************************/
#define KMAX_TX_MB_PER_CONTROLLER               (32U)

/*****************************************************************************
 *
 * \brief Max number of standard filters per controller 
 *
 *****************************************************************************/
#define KMAX_STD_FILTERS_PER_CONTROLLER         (128U)

/*****************************************************************************
 *
 * \brief Max number of standard filters per controller 
 *
 *****************************************************************************/
#define KMAX_EXTD_FILTERS_PER_CONTROLLER         (64U)

#endif /* DOXYGEN_SHOULD_SKIP_THIS */

/*********************************************************************************************************************
 * Exported Preprocessor #define Macros
 *********************************************************************************************************************/

/*********************************************************************************************************************
 * Exported Type Declarations
 *********************************************************************************************************************/

/** \brief   Enum for the event pin. */
typedef enum
{
    /** \brief  EVENT PIN0 */
    CAN_EVENT_PIN_0 = 0x0U,
    /** \brief EVENT PIN1 */
    CAN_EVENT_PIN_1 = 0x1U,
    /** \brief EVENT NONE */
    CAN_EVENT_PIN_NONE = 0x2U,
} Can_EventPin;

