TexasInstruments/f29h85x-mcal/plugins/Can_TI_F29H85x/generate/include/Can_Cfg.h
/** \brief   Enum for the Can standard filter selection. */
typedef enum
{
    /** \brief  Range filter from SFID1 to SFID2 (SFID2 ≥ SFID1) */
    CAN_RANGE_FILTER = 0x0U,
    /** \brief  Dual ID filter for SFID1 or SFID2 */
    CAN_DUAL_ID_FILTER = 0x1U,
    /** \brief  Classic filter: SFID1 = filter; SFID2 = mask */
    CAN_CLASSIC_FILTER = 0x2U,
    /** \brief  Filter element disabled */
    CAN_SFT_FILTER_DISABLED_EFT_RANGE_NO_XIDAM = 0x03,
} Can_StandardFilterType;

/*********************************************************************************************************************
 * Exported Object Declarations
 *********************************************************************************************************************/
[!LOOP "CanConfigSet"!][!//
/** \brief CAN Configuration struct declaration */
extern const struct Can_ConfigType_s Can_Config;
[!ENDLOOP!][!//

[!IF "IMPLEMENTATION_CONFIG_VARIANT = 'VariantPostBuild'"!]
[!LOOP "CanConfigSet"!][!LOOP "CanController/*"!][!//
[!LOOP "CanControllerBaudrateConfig/*"!][!//

/* Baud Rate Structure for all configsets */
extern CONST(struct Can_BaudConfigType_s, CAN_CONFIG_DATA) [!"../../../../@name"!]_[!"../../@name"!]_[!"@name"!];

[!ENDLOOP!][!ENDLOOP!][!ENDLOOP!][!//

/*List of the Baudrate structures */
[!LOOP "CanConfigSet"!][!LOOP "CanController/*"!][!//

extern CONST(struct Can_BaudConfigType_s*, CAN_CONFIG_DATA) [!"../../@name"!]_[!"@name"!]_BaudRateConfigList[[!"num:i(count(CanControllerBaudrateConfig/*))"!]];
[!ENDLOOP!][!ENDLOOP!][!//

[!LOOP "CanConfigSet"!][!LOOP "CanController/*"!][!//
/* Controller structure for [!"../../@name"!]_[!"@name"!]*/
extern CONST(struct Can_ControllerType_s, CAN_CONFIG_DATA) [!"../../@name"!]_[!"@name"!];

[!ENDLOOP!][!ENDLOOP!][!//


#if (CAN_CFG_ICOM_SUPPORT == STD_ON)
[!LOOP "CanConfigSet/CanIcom/CanIcomConfig/*"!][!//
/* Icom configuration for  [!"@name"!] */
extern CONST(struct Can_IcomConfigType_s, CAN_CONFIG_DATA) Can_[!"@name"!];
[!ENDLOOP!][!//

extern CONST(struct Can_IcomConfigType_s*, CAN_CONFIG_DATA) Can_IcomConfigurationList[[!"num:i(count(CanConfigSet/CanIcom/CanIcomConfig/*))"!]];
#endif
[!ENDIF!]
[!ENDSELECT!]

/*********************************************************************************************************************
 *  Exported Function Prototypes
 *********************************************************************************************************************/
 
/*********************************************************************************************************************
 *  Exported Inline Function Definitions and Function-Like Macros
 *********************************************************************************************************************/
 
#ifdef __cplusplus
}
#endif
/**
 * @}
 */
#endif /* CAN_CFG_H */
/*********************************************************************************************************************
 *  End of File: Can_Cfg.h
 *********************************************************************************************************************/
